import { useNavigate } from 'react-router';
import articleImg from '../../assets/article-4.jpg';
import { CustomButton } from 'components/CustomButton';

const Article4 = () => {
  const navigate = useNavigate();
  return (
    <div className="container">
      <article className="gap-20 grid grid-cols-1 md:grid-cols-2 mt-100 mb-64">
        <div className="font-normal text-base text-left">
          <div className="relative bg-orange mb-40 rounded-[30px] w-[345px] md:w-[630px] h-[158px] md:h-[481px]">
            <img
              src={articleImg}
              alt="дівчата градять котика"
              className="bottom-0 left-0 absolute w-[336px] md:w-[614px] h-[150px] md:h-[465px]"
            />
          </div>
          <h1 className="md:mt-[320px] 2xl:mt-0 mb-16 font-bold text-3xl">
            Емоційний добробут: Створення щасливого та здорового середовища для
            вашого нового улюбленця
          </h1>
          <p>
            Емоційний добробут так само важливий для тварини, як і фізичне
            здоров&#39;я. Тварини з притулку часто пережили стрес, втрату або
            жорстоке поводження, що може негативно вплинути на їхній емоційний
            стан. Цей розділ допоможе вам зрозуміти емоційні потреби вашого
            нового улюбленця та створити для нього середовище, в якому він зможе
            почуватися в безпеці, коханим та щасливим.
          </p>
          <h2 className="mt-32 mb-16 font-semibold text-xl">
            Подолання травм минулого:
          </h2>
          <ul className="flex flex-col mt-16 ml-16 pl-5 list-disc">
            <li>
              Розуміння емоційних потреб:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Тварини, які пережили жорстоке поводження, можуть боятися
                  людей, гучних звуків або певних рухів.
                </li>
                <li>
                  Тварини, які втратили господаря, можуть відчувати смуток або
                  тривогу розлуки.
                </li>
                <li>
                  Тварини, які довго перебували в притулку, можуть мати проблеми
                  з адаптацією до домашнього життя.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Створення безпечного середовища:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Забезпечте тварині тихе та спокійне місце, де вона зможе
                  сховатися, коли відчуває страх або тривогу.
                </li>
                <li>
                  Уникайте гучних звуків, різких рухів та інших стресових
                  факторів.
                </li>
                <li>
                  Будьте передбачуваними у своїх діях та створіть чіткий режим
                  дня.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Позитивне підкріплення:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Використовуйте позитивне підкріплення (ласощі, похвала, ігри)
                  для заохочення бажаної поведінки.
                </li>
                <li>
                  Ігноруйте небажану поведінку, якщо вона не є небезпечною.
                </li>
                <li>
                  Ніколи не використовуйте покарання, це може посилити страх та
                  агресію.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Терпіння та любов:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>Будьте терплячими та дайте тварині час адаптуватися</li>
                <li>Проявляйте любов та турботу, щоб завоювати її довіру.</li>
                <li>
                  Пам&#39;ятайте, що побудова міцного зв&#39;язку потребує часу.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Професійна допомога:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Якщо у тварини серйозні поведінкові проблеми, зверніться до
                  зоопсихолога.
                </li>
                <li>
                  Зоопсихолог допоможе вам зрозуміти причини проблем та
                  розробити індивідуальний план корекції поведінки.
                </li>
              </ul>
            </li>
          </ul>
        </div>

        <div className="font-normal text-base text-left">
          <h2 className="mb-16 font-semibold text-xl">
            Встановлення зв&#39;язку з людиною:
          </h2>
          <p>
            Побудова міцного та довірливого зв&#39;язку з твариною – це ключ до
            її емоційного добробуту.
          </p>
          <ul className="flex flex-col mt-16 ml-16 pl-5 list-disc">
            <li>
              Проведення часу разом:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>Проводьте з твариною якомога більше часу.</li>
                <li>
                  Грайте з нею, гладьте її, розмовляйте з нею спокійним тоном.
                </li>
                <li>
                  Дозволяйте їй спати поруч з вами (якщо це можливо і бажано).
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Ігри та розваги:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Ігри допомагають тварині розслабитися, зняти стрес та
                  вивільнити енергію.
                </li>
                <li>Обирайте ігри, які відповідають її виду та породі.</li>
                <li>
                  Використовуйте іграшки, які стимулюють розумову діяльність.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Навчання командам та трюкам:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Навчання командам та трюкам – це чудовий спосіб зміцнити
                  зв&#39;язок з твариною.
                </li>
                <li>
                  Це також допомагає їй розвиватись інтелектуально та почуватись
                  корисною.
                </li>
                <li>
                  Використовуйте позитивне підкріплення та будьте терплячими.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Спільні прогулянки та подорожі:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Прогулянки та подорожі – це чудовий спосіб розширити кругозір
                  тварини та познайомити її з новим досвідом.
                </li>
                <li>
                  Вони також допомагають їй зняти стрес та вивільнити енергію.
                </li>
                <li>
                  Починайте з коротких прогулянок поблизу дому та поступово
                  збільшуйте їх тривалість.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Увага та турбота:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>Показуйте тварині, що вона важлива та кохана.</li>
                <li>Будьте уважні до її потреб та реагуйте на її сигнали.</li>
                <li>Забезпечте їй комфортне та безпечне середовище.</li>
              </ul>
            </li>
          </ul>

          <h2 className="mt-32 mb-16 font-semibold text-xl">
            Підтримка ментального здоров&#39;я:
          </h2>
          <p>
            Ментальне здоров&#39;я так само важливе для тварини, як і фізичне.
          </p>
          <ul className="flex flex-col mt-16 ml-16 pl-5 list-disc">
            <li>
              Фізичні вправи та розумова стимуляція:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Регулярні фізичні вправи допомагають тварині вивільнити
                  енергію та зняти стрес.
                </li>
                <li>
                  Розумова стимуляція (ігри, іграшки-головоломки, навчання
                  командам) допомагає їй розвиватись інтелектуально та уникати
                  нудьги.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Уникання нудьги та самотності:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Залишаючи тварину наодинці, забезпечте їй достатню кількість
                  іграшок та розваг.
                </li>
                <li>
                  Розгляньте можливість завести другу тварину, якщо у вас є час
                  та ресурси для догляду за нею.
                </li>
                <li>
                  Якщо ви часто відсутні, попросіть когось відвідувати тварину
                  або найміть вигульника для собак.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Передбачуваність та стабільність:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Тварини почуваються в безпеці, коли їхнє життя є
                  передбачуваним та стабільним.
                </li>
                <li>
                  Дотримуйтесь чіткого режиму дня, годуйте тварину в один і той
                  же час, гуляйте з нею в один і той же час.
                </li>
                <li>Уникайте різких змін у вашому житті, якщо це можливо.</li>
              </ul>
            </li>
            <li className="mt-16">
              Позитивне спілкування:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>Розмовляйте з твариною спокійним та лагідним тоном.</li>
                <li>Використовуйте позитивні слова та фрази.</li>
                <li>Уникайте криків та лайки.</li>
              </ul>
            </li>
            <li className="mt-16">
              Регулярні огляди у ветеринара:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Регулярні огляди у ветеринара допомагають виявити та запобігти
                  проблемам зі здоров&#39;ям, які можуть вплинути на емоційний
                  стан тварини.
                </li>
              </ul>
            </li>
          </ul>
        </div>
      </article>
      <CustomButton
        className="z-10 bg-default-btn mb-100 rounded-[20px] w-[356px] h-[44px]"
        onClick={() => navigate(-1)}
      >
        Повернутися до попередньої сторінки
      </CustomButton>
    </div>
  );
};

export default Article4;
