import articleImg from '../../assets/article-4.jpg';

const Article4 = () => {
  return (
    <div className="container">
      <article className="gap-20 grid grid-cols-1 md:grid-cols-2 mt-100 mb-64">
        <div className="font-normal text-base text-left">
          <div className="relative bg-orange mb-40 rounded-[30px] w-[345px] md:w-[630px] h-[158px] md:h-[481px]">
            <img
              src={articleImg}
              alt="дівчата градять котика"
              className="bottom-0 left-0 absolute w-[336px] md:w-[614px] h-[150px] md:h-[465px]"
            />
          </div>
          <h1 className="md:mt-[320px] 2xl:mt-0 mb-16 font-bold text-3xl">
            Емоційний добробут: Створення щасливого та здорового середовища для
            вашого нового улюбленця
          </h1>
          <p>
            Емоційний добробут так само важливий для тварини, як і фізичне
            здоров&#39;я. Тварини з притулку часто пережили стрес, втрату або
            жорстоке поводження, що може негативно вплинути на їхній емоційний
            стан. Цей розділ допоможе вам зрозуміти емоційні потреби вашого
            нового улюбленця та створити для нього середовище, в якому він зможе
            почуватися в безпеці, коханим та щасливим.
          </p>
          <h2 className="mt-32 mb-16 font-semibold text-xl">
            Подолання травм минулого:
          </h2>
          <ul className="flex flex-col mt-16 ml-16 pl-5 list-disc">
            <li>
              Розуміння емоційних потреб:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Тварини, які пережили жорстоке поводження, можуть боятися
                  людей, гучних звуків або певних рухів.
                </li>
                <li>
                  Тварини, які втратили господаря, можуть відчувати смуток або
                  тривогу розлуки.
                </li>
                <li>
                  Тварини, які довго перебували в притулку, можуть мати проблеми
                  з адаптацією до домашнього життя.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Створення безпечного середовища:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Забезпечте тварині тихе та спокійне місце, де вона зможе
                  сховатися, коли відчуває страх або тривогу.
                </li>
                <li>
                  Уникайте гучних звуків, різких рухів та інших стресових
                  факторів.
                </li>
                <li>
                  Будьте передбачуваними у своїх діях та створіть чіткий режим
                  дня.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Позитивне підкріплення:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Використовуйте позитивне підкріплення (ласощі, похвала, ігри)
                  для заохочення бажаної поведінки.
                </li>
                <li>
                  Ігноруйте небажану поведінку, якщо вона не є небезпечною.
                </li>
                <li>
                  Ніколи не використовуйте покарання, це може посилити страх та
                  агресію.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Терпіння та любов:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>Будьте терплячими та дайте тварині час адаптуватися</li>
                <li>Проявляйте любов та турботу, щоб завоювати її довіру.</li>
                <li>
                  Пам&#39;ятайте, що побудова міцного зв&#39;язку потребує часу.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Професійна допомога:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Якщо у тварини серйозні поведінкові проблеми, зверніться до
                  зоопсихолога.
                </li>
                <li>
                  Зоопсихолог допоможе вам зрозуміти причини проблем та
                  розробити індивідуальний план корекції поведінки.
                </li>
              </ul>
            </li>
          </ul>
        </div>

        <div className="font-normal text-base text-left"></div>
      </article>
    </div>
  );
};

export default Article4;
