const Article3 = () => {
  return (
    <div className="container">
      <article className="gap-20 grid grid-cols-1 md:grid-cols-2 mt-100 mb-64">
        <div className="font-normal text-base text-left">
          <h1 className="mb-16 font-bold text-3xl">
            Знайдіть свого ідеального компаньйона: Поради щодо вибору тварини
          </h1>
          <p>
            Усиновлюючи тварину з притулку, важливо пам&#39;ятати, що її
            здоров&#39;я може відрізнятися від здоров&#39;я тварини, яка виросла
            вдома. Багато тварин з притулку пережили стрес, погане харчування
            або хвороби. Цей розділ допоможе вам зрозуміти можливі проблеми зі
            здоров&#39;ям вашого нового улюбленця та дізнатися, як забезпечити
            йому належний догляд.
          </p>
          <h2 className="mt-32 mb-16 font-semibold text-xl">
            Медична історія:
          </h2>
          <p>
            Знання медичної історії тварини – це ключ до забезпечення
            правильного догляду.
          </p>
          <ul className="flex flex-col mt-16 ml-16 pl-5 list-disc">
            <li>
              Інформація про попередні захворювання та лікування:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Запитайте у працівників притулку про всі відомі захворювання,
                  травми або операції, які перенесла тварина.
                </li>
                <li>
                  Дізнайтеся, які ліки вона приймала і чи потребує вона їх
                  надалі.
                </li>
                <li>Попросіть надати копії медичних записів, якщо вони є.</li>
                <li>
                  Якщо медична історія невідома, будьте готові до того, що
                  тварині можуть знадобитися додаткові обстеження.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Потреба у спеціальному догляді (ліки, дієта):
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Деякі тварини потребують постійного прийому ліків (наприклад,
                  при хронічних захворюваннях).
                </li>
                <li>
                  Іншим може знадобитися спеціальна дієта (наприклад, при
                  алергії або проблемах з травленням).
                </li>
                <li>
                  З&#39;ясуйте, чи є у тварини особливі потреби, і чи готові ви
                  їх забезпечити.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Рекомендовані обстеження та вакцинація:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Після усиновлення обов&#39;язково відвідайте ветеринара для
                  повного обстеження.
                </li>
                <li>
                  Ветеринар може порекомендувати додаткові обстеження (аналізи
                  крові, рентген, УЗД) для оцінки загального стану здоров&#39;я.
                </li>
                <li>
                  Переконайтеся, що тварина отримала всі необхідні вакцини та
                  ревакцинації.
                </li>
                <li>
                  Обговоріть з ветеринаром графік подальших вакцинацій та
                  профілактичних оглядів.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Паразити:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Переконайтеся, що тварина пройшла обробку від паразитів у
                  притулку.
                </li>
                <li>Повторіть обробку вдома за рекомендацією ветеринара.</li>
                <li>
                  Дотримуйтесь профілактичних заходів для запобігання повторному
                  зараженню.
                </li>
              </ul>
            </li>
            <li className="mt-16">
              Стерилізація/Кастрація:
              <ul className="flex flex-col space-y-1 mt-2 ml-12 pl-5 list-disc">
                <li>
                  Дізнайтеся, чи була тварина стерилізована або кастрована.
                </li>
                <li>Якщо ні, обговоріть цю процедуру з ветеринаром.</li>
                <li>
                  Стерилізація/кастрація має багато переваг для здоров&#39;я
                  тварини
                </li>
              </ul>
            </li>
          </ul>
        </div>
        <div className="font-normal text-base text-left"></div>
      </article>
    </div>
  );
};

export default Article3;
