import articleImg from '../../assets/article-2.jpg';

const Article2 = () => {
  return (
    <div className="container">
      <article className="gap-20 grid grid-cols-1 md:grid-cols-2 mt-100 mb-64">
        <div className="font-normal text-base text-left">
          <div className="relative bg-orange mb-40 rounded-[30px] w-[345px] md:w-[627px] h-[158px] md:h-[390px]">
            <img
              src={articleImg}
              alt="дівчина тримає кролика"
              className="bottom-0 left-0 absolute rounded-[30px] w-[336px] md:w-[611px] h-[150px] md:h-[374px]"
            />
          </div>
          <h1 className="md:mt-[320px] 2xl:mt-0 mb-16 font-semibold text-3xl">
            Адаптація до нового дому
          </h1>
          <p className="indent-24">
            Усиновлення тварини з притулку – це благородний вчинок, який дає
            шанс на щасливе життя тому, хто цього потребує
          </p>
          <p className="mb-32 indent-24">
            Однак, важливо пам&#39;ятати, що таким тваринам може знадобитися
            більше часу та терпіння для адаптації до нових умов. Вони можуть
            мати травми минулого, страхи або проблеми зі здоров&#39;ям, які
            потребують особливої уваги. Цей розділ надасть вам практичні поради
            та інформацію, щоб допомогти вашому новому улюбленцю почуватися в
            безпеці та комфорті у вашому домі, а вам – побудувати міцний та
            довірливий зв&#39;язок.
          </p>
          <p className="indent-24">
            <strong>Перші дні вдома</strong> – це критичний період для адаптації
            тварини. Важливо створити максимально спокійне та передбачуване
            середовище.
          </p>
          <p className="indent-24">
            <span className="underline">Підготовка місця:</span> Заздалегідь
            підготуйте &quot;безпечне місце&quot; для тварини. Це може бути
            лежанка, клітка або переноска, де вона може сховатися та відчути
            себе в безпеці.
          </p>
          <p className="indent-24">
            Розмістіть там миски для їжі та води, лоток (для котів), іграшки. Не
            змушуйте тварину виходити з цього місця, дайте їй час освоїтися.
          </p>
          <p className="indent-24">
            <span className="underline"> Перші контакти:</span> Підходьте до
            тварини спокійно та тихо. Не робіть різких рухів та гучних звуків.
            Пропонуйте ласощі з руки, але не змушуйте брати. Дайте тварині
            можливість обнюхати вас. Починайте з коротких сеансів взаємодії.
          </p>
          <p className="indent-24">
            <span className="underline">Режим дня:</span> Постарайтеся
            встановити чіткий режим годування, прогулянок (для собак) та сну. Це
            допоможе тварині відчути стабільність та безпеку.
          </p>
          <p className="indent-24">
            <span className="underline"> Спостереження:</span> Уважно
            спостерігайте за поведінкою тварини. Звертайте увагу на ознаки
            стресу (підтиснутий хвіст, притиснуті вуха, тремтіння, відсутність
            апетиту). Якщо ви помічаєте тривожні симптоми, зверніться до
            ветеринара або зоопсихолога.
          </p>
        </div>

        <div className="font-normal text-base text-left"></div>
      </article>
    </div>
  );
};

export default Article2;
