import articleImg from '../../assets/article-2.jpg';
import articleCat from '../../assets/article-2-cat.jpg';
import articleDog from '../../assets/article-2-dog.jpg';
import { useNavigate } from 'react-router';
import { CustomButton } from 'components/CustomButton';

const Article2 = () => {
  const navigate = useNavigate();
  return (
    <div className="container">
      <article className="gap-20 grid grid-cols-1 xl:grid-cols-2 mt-100 mb-50">
        <div className="font-normal text-base text-left">
          <div className="relative justify-self-center bg-orange mb-40 rounded-[30px] w-[345px] md:w-[627px] h-[247px] md:h-[390px]">
            <img
              src={articleImg}
              alt="дівчина тримає кролика"
              className="bottom-0 left-0 absolute rounded-[30px] w-[335px] md:w-[611px] h-[231px] md:h-[374px]"
            />
          </div>
          <h1 className="mb-16 font-semibold text-3xl">
            Адаптація до нового дому
          </h1>
          <p className="indent-24">
            Усиновлення тварини з притулку – це благородний вчинок, який дає
            шанс на щасливе життя тому, хто цього потребує
          </p>
          <p className="mb-32 indent-24">
            Однак, важливо пам&#39;ятати, що таким тваринам може знадобитися
            більше часу та терпіння для адаптації до нових умов. Вони можуть
            мати травми минулого, страхи або проблеми зі здоров&#39;ям, які
            потребують особливої уваги. Цей розділ надасть вам практичні поради
            та інформацію, щоб допомогти вашому новому улюбленцю почуватися в
            безпеці та комфорті у вашому домі, а вам – побудувати міцний та
            довірливий зв&#39;язок.
          </p>
          <p className="indent-24">
            <strong>Перші дні вдома</strong> – це критичний період для адаптації
            тварини. Важливо створити максимально спокійне та передбачуване
            середовище.
          </p>
          <p className="indent-24">
            <span className="underline">Підготовка місця:</span> Заздалегідь
            підготуйте &quot;безпечне місце&quot; для тварини. Це може бути
            лежанка, клітка або переноска, де вона може сховатися та відчути
            себе в безпеці.
          </p>
          <p className="indent-24">
            Розмістіть там миски для їжі та води, лоток (для котів), іграшки. Не
            змушуйте тварину виходити з цього місця, дайте їй час освоїтися.
          </p>
          <p className="indent-24">
            <span className="underline"> Перші контакти:</span> Підходьте до
            тварини спокійно та тихо. Не робіть різких рухів та гучних звуків.
            Пропонуйте ласощі з руки, але не змушуйте брати. Дайте тварині
            можливість обнюхати вас. Починайте з коротких сеансів взаємодії.
          </p>
          <p className="indent-24">
            <span className="underline">Режим дня:</span> Постарайтеся
            встановити чіткий режим годування, прогулянок (для собак) та сну. Це
            допоможе тварині відчути стабільність та безпеку.
          </p>
          <p className="indent-24">
            <span className="underline"> Спостереження:</span> Уважно
            спостерігайте за поведінкою тварини. Звертайте увагу на ознаки
            стресу (підтиснутий хвіст, притиснуті вуха, тремтіння, відсутність
            апетиту). Якщо ви помічаєте тривожні симптоми, зверніться до
            ветеринара або зоопсихолога.
          </p>
        </div>

        <div className="font-normal text-base text-left">
          <div className="flex md:flex-row flex-col justify-between items-center gap-8 mb-[30px]">
            <img
              src={articleCat}
              alt="котик"
              className="rounded-[30px] w-[303px] h-[213px]"
            />
            <img
              src={articleDog}
              alt="собака розірвав подушку"
              className="rounded-[30px] w-[303px] h-[213px]"
            />
          </div>
          <p className="indent-24">
            <strong>Соціалізація:</strong> – це процес знайомства тварини з
            навколишнім світом, іншими людьми та тваринами. Для тварин з
            притулку цей процес може бути складнішим, ніж для тих, які виросли
            вдома. Залучайте всіх членів сім&#39;ї до процесу адаптації.
          </p>
          <p className="indent-24">
            Навчіть дітей правилам поводження з тваринами (не смикати, не
            кричати, не турбувати під час їжі або сну). Дозволяйте тварині
            поступово звикати до кожного члена сім&#39;ї.
          </p>
          <p className="indent-24">
            <span className="underline">Соціалізація з іншими тваринами</span>
            Знайомте тварин поступово, під наглядом. Спочатку дозвольте їм
            обнюхати один одного через двері або клітку. Перші зустрічі повинні
            бути короткими та позитивними. Не залишайте тварин наодинці, поки не
            будете впевнені, що вони ладнають.
          </p>
          <p className="indent-24">
            <span className="underline">
              Соціалізація із зовнішнім світом (для собак):
            </span>
            Почніть з коротких прогулянок поблизу дому та поступово збільшуйте
            тривалість та маршрут прогулянок.
          </p>
          <p className="indent-24">
            Знайомте собаку з різними звуками, запахами та людьми.
            Використовуйте позитивне підкріплення (ласощі, похвала) за спокійну
            поведінку.
          </p>
          <p className="indent-24">
            <span className="underline">Навчання та дресирування:</span>
            Почніть з простих команд (сидіти, лежати, місце). Використовуйте
            позитивне підкріплення (ласощі, похвала). Будьте терплячими та
            послідовними. Розгляньте можливість відвідування курсів
            дресирування.
          </p>
          <p className="indent-24">
            <strong>Поведінкові проблеми</strong>
          </p>
          <p>
            Тварини з притулку можуть мати різні поведінкові проблеми,
            пов&#39;язані з минулим досвідом. Важливо розуміти причини цих
            проблем та знати, як їх вирішувати.
          </p>

          <p className="indent-24">
            <span className="underline">Страх та тривожність:</span>
            створіть безпечне та передбачуване середовище. Уникайте ситуацій,
            які викликають страх.
          </p>
          <p className="indent-24">
            <span className="underline">Агресія:</span>
            Визначте причину агресії (страх, біль, захист). Не використовуйте
            покарання, це може погіршити проблему. Зверніться до зоопсихолога
            для професійної допомоги.
          </p>
          <p className="indent-24">
            <span className="underline">Руйнівна поведінка: </span>
            Забезпечте достатню кількість іграшок та розваг. Збільште фізичну
            активність тварини. Визначте причину руйнівної поведінки (нудьга,
            тривога, нестача уваги).
          </p>
          <p className="indent-24">
            <span className="underline">Проблеми з туалетом:</span>
            Переконайтеся, що лоток (для котів) або місце для туалету (для
            собак) чисте та доступне. Виключіть медичні причини проблеми.
            Використовуйте позитивне підкріплення за правильне використання
            туалету.
          </p>
        </div>
      </article>
      <CustomButton
        className="z-10 bg-default-btn mb-100 rounded-[20px] w-[356px] h-[44px]"
        onClick={() => navigate(-1)}
      >
        Повернутися до попередньої сторінки
      </CustomButton>
    </div>
  );
};

export default Article2;
