import articleImg from '../../assets/article-6.1.jpg';

const Article6 = () => {
  return (
    <div className="container">
      <article className="gap-20 grid grid-cols-1 md:grid-cols-2 mt-100 mb-64">
        <div className="font-normal text-base text-left">
          <div className="relative bg-orange mb-40 rounded-[30px] w-[627px] h-[431px]">
            <img
              src={articleImg}
              alt="дівчата градять котика"
              className="bottom-0 left-0 absolute w-[611px] h-[415px]"
            />
          </div>
          <h2 className="mb-16 font-semibold text-xl">Терапевтична роль</h2>
          <p>
            Анімалотерапія (лікування за допомогою тварин) активно
            використовується в лікарнях, будинках для літніх людей,
            реабілітаційних центрах. Спілкування з тваринами допомагає пацієнтам
            подолати емоційні труднощі, пришвидшує одужання та підвищує
            мотивацію до лікування. Наприклад, собаки-терапевти часто працюють з
            дітьми з аутизмом, людьми з посттравматичними розладами та іншими
            психічними проблемами.
          </p>
          <h2 className="mt-32 mb-16 font-semibold text-xl">Взаємна вигода</h2>
          <p>
            Відносини між людиною і твариною — це приклад гармонійної взаємодії.
            Люди надають тваринам захист, їжу та любов, а ті у відповідь дарують
            тепло, безумовну підтримку та навіть рятують життя. Службові
            тварини, як-от собаки-поводирі чи рятувальники, — незамінні
            помічники в повсякденному житті людей з обмеженими можливостями.
          </p>
          <p className="mt-16">
            Тварини не просто супутники — вони друзі, помічники й терапевти.
            Їхній вплив на наше життя глибокий і багатогранний. Дбайливе
            ставлення до братів наших менших — це шлях до здоровішого,
            щасливішого суспільства.
          </p>
        </div>

        <div className="font-normal text-base text-left"></div>
      </article>
    </div>
  );
};

export default Article6;
